app/views/reservations/edit.html.erb

SELECT "salles".* FROM "salles"
---
            <%= form.label :salle_id, 'Nom de la Salle', class: 'form-label' %>
            <%= form.collection_select :salle_id, Salle.all, :id, :name, { prompt: "Sélectionner une salle" }, class: 'form-control' %>