app/views/reservations/index.html.erb

SELECT "salles".* FROM "salles" WHERE "salles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <h5>Réservation ID: <%= reservation.id %></h5>
        <p><strong>Nom de la Salle:</strong> <%= reservation.salle.present? ? reservation.salle.name : "Salle inconnue" %></p>